In [3]:
# !pip install pandas
# !pip install numpy

In [22]:
import pandas as pd
import numpy as np

In [5]:
data = {
    "Empid":[x for x in range(101,111)],
    "Empname":["Raj",'Ravi','Raman','Anu','Diya','Siya','Simran','Gunja','Shiva','Abhishek'],
    "Empsal":[23430,23560,56530,34550,46340,76860,35420,67550,55430,35430]
}

In [7]:
df = pd.DataFrame(data)

In [8]:
df

   Empid   Empname  Empsal
0    101       Raj   23430
1    102      Ravi   23560
2    103     Raman   56530
3    104       Anu   34550
4    105      Diya   46340
5    106      Siya   76860
6    107    Simran   35420
7    108     Gunja   67550
8    109     Shiva   55430
9    110  Abhishek   35430

In [10]:
df.head()  # default 5 rows

   Empid Empname  Empsal
0    101     Raj   23430
1    102    Ravi   23560
2    103   Raman   56530
3    104     Anu   34550
4    105    Diya   46340

In [11]:
df.head(3)

   Empid Empname  Empsal
0    101     Raj   23430
1    102    Ravi   23560
2    103   Raman   56530

In [13]:
df.tail()  # last 5 rows

   Empid   Empname  Empsal
5    106      Siya   76860
6    107    Simran   35420
7    108     Gunja   67550
8    109     Shiva   55430
9    110  Abhishek   35430

In [14]:
df.tail(3)

   Empid   Empname  Empsal
7    108     Gunja   67550
8    109     Shiva   55430
9    110  Abhishek   35430

In [15]:
df.shape

(10, 3)

In [18]:
print(df.shape[0]  ,df.shape[1])

10 3

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Empid    10 non-null     int64
 1   Empname  10 non-null     object
 2   Empsal   10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 372.0+ bytes

In [20]:
df.describe()

           Empid       Empsal
count   10.00000     10.00000
mean   105.50000  45510.00000
std      3.02765  18202.51753
min    101.00000  23430.00000
25%    103.25000  34767.50000
50%    105.50000  40885.00000
75%    107.75000  56255.00000
max    110.00000  76860.00000

In [23]:
data = {
    "Empid":[x for x in range(101,111)],
    "Empname":["Raj",'Ravi','Raman',np.nan,'Diya','Siya','Simran','Gunja',np.nan,'Abhishek'],
    "Empsal":[23430,23560,56530,34550,46340,76860,np.nan,67550,55430,35430]
}

In [24]:
df = pd.DataFrame(data)

In [25]:
df

   Empid   Empname   Empsal
0    101       Raj  23430.0
1    102      Ravi  23560.0
2    103     Raman  56530.0
3    104       NaN  34550.0
4    105      Diya  46340.0
5    106      Siya  76860.0
6    107    Simran      NaN
7    108     Gunja  67550.0
8    109       NaN  55430.0
9    110  Abhishek  35430.0

In [26]:
df.isnull()

   Empid  Empname  Empsal
0  False    False   False
1  False    False   False
2  False    False   False
3  False     True   False
4  False    False   False
5  False    False   False
6  False    False    True
7  False    False   False
8  False     True   False
9  False    False   False

In [27]:
df.isnull().sum()

Empid      0
Empname    2
Empsal     1
dtype: int64

In [28]:
df.isnull().sum().sum()

np.int64(3)

In [29]:
df['Empname']

0         Raj
1        Ravi
2       Raman
3         NaN
4        Diya
5        Siya
6      Simran
7       Gunja
8         NaN
9    Abhishek
Name: Empname, dtype: object

In [30]:
df.Empname

0         Raj
1        Ravi
2       Raman
3         NaN
4        Diya
5        Siya
6      Simran
7       Gunja
8         NaN
9    Abhishek
Name: Empname, dtype: object

In [31]:
df.Empsal

0    23430.0
1    23560.0
2    56530.0
3    34550.0
4    46340.0
5    76860.0
6        NaN
7    67550.0
8    55430.0
9    35430.0
Name: Empsal, dtype: float64

In [32]:
df.Empsal.min()

np.float64(23430.0)

In [33]:
df.Empsal.max()

np.float64(76860.0)

In [34]:
df.Empsal.mean()

np.float64(46631.11111111111)

In [35]:
df.Empsal.sum()

np.float64(419680.0)

In [36]:
df.Empsal.count()

np.int64(9)

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Empid    10 non-null     int64
 1   Empname  8 non-null      object
 2   Empsal   9 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 372.0+ bytes

In [38]:
df

   Empid   Empname   Empsal
0    101       Raj  23430.0
1    102      Ravi  23560.0
2    103     Raman  56530.0
3    104       NaN  34550.0
4    105      Diya  46340.0
5    106      Siya  76860.0
6    107    Simran      NaN
7    108     Gunja  67550.0
8    109       NaN  55430.0
9    110  Abhishek  35430.0

In [41]:
df.Empsal = df.Empsal+df.Empsal*10/100

In [42]:
df

   Empid   Empname   Empsal
0    101       Raj  25773.0
1    102      Ravi  25916.0
2    103     Raman  62183.0
3    104       NaN  38005.0
4    105      Diya  50974.0
5    106      Siya  84546.0
6    107    Simran      NaN
7    108     Gunja  74305.0
8    109       NaN  60973.0
9    110  Abhishek  38973.0

In [43]:
df.dropna()

   Empid   Empname   Empsal
0    101       Raj  25773.0
1    102      Ravi  25916.0
2    103     Raman  62183.0
4    105      Diya  50974.0
5    106      Siya  84546.0
7    108     Gunja  74305.0
9    110  Abhishek  38973.0

In [44]:
df

   Empid   Empname   Empsal
0    101       Raj  25773.0
1    102      Ravi  25916.0
2    103     Raman  62183.0
3    104       NaN  38005.0
4    105      Diya  50974.0
5    106      Siya  84546.0
6    107    Simran      NaN
7    108     Gunja  74305.0
8    109       NaN  60973.0
9    110  Abhishek  38973.0

In [45]:
df.fillna(value='Missing Value')

   Empid        Empname         Empsal
0    101            Raj        25773.0
1    102           Ravi        25916.0
2    103          Raman        62183.0
3    104  Missing Value        38005.0
4    105           Diya        50974.0
5    106           Siya        84546.0
6    107         Simran  Missing Value
7    108          Gunja        74305.0
8    109  Missing Value        60973.0
9    110       Abhishek        38973.0

In [47]:
df.Empname = df.Empname.fillna(value="No Name")

In [48]:
df

   Empid   Empname   Empsal
0    101       Raj  25773.0
1    102      Ravi  25916.0
2    103     Raman  62183.0
3    104   No Name  38005.0
4    105      Diya  50974.0
5    106      Siya  84546.0
6    107    Simran      NaN
7    108     Gunja  74305.0
8    109   No Name  60973.0
9    110  Abhishek  38973.0

In [50]:
round(df.Empsal.mean(),2)

np.float64(51294.22)

In [51]:
df.Empsal = df.Empsal.fillna(value = round(df.Empsal.mean(),2))

In [52]:
df

   Empid   Empname    Empsal
0    101       Raj  25773.00
1    102      Ravi  25916.00
2    103     Raman  62183.00
3    104   No Name  38005.00
4    105      Diya  50974.00
5    106      Siya  84546.00
6    107    Simran  51294.22
7    108     Gunja  74305.00
8    109   No Name  60973.00
9    110  Abhishek  38973.00

In [53]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [54]:
df.duplicated().sum()

np.int64(0)

In [55]:
df = df.drop_duplicates()

In [56]:
df

   Empid   Empname    Empsal
0    101       Raj  25773.00
1    102      Ravi  25916.00
2    103     Raman  62183.00
3    104   No Name  38005.00
4    105      Diya  50974.00
5    106      Siya  84546.00
6    107    Simran  51294.22
7    108     Gunja  74305.00
8    109   No Name  60973.00
9    110  Abhishek  38973.00

In [57]:
df = pd.read_excel(r"C:\Users\Croma Campus\Downloads\Financial_Sample.xlsx")

In [58]:
df.shape

(700, 16)

In [59]:
df.head(2)

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
0,Government,Canada,Carretera,NaN,1618.5,3,20.0,32370.0,0.0,32370.0,16185.0,16185.0,2014-01-01,1,January,2014
1,Government,Germany,Carretera,NaN,1321.0,3,20.0,26420.0,0.0,26420.0,13210.0,13210.0,2014-01-01,1,January,2014

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 16 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Segment              692 non-null    object
 1   Country              689 non-null    object
 2   Product              692 non-null    object
 3   Discount Band        638 non-null    object
 4   Units Sold           695 non-null    float64
 5   Manufacturing Price  700 non-null    int64
 6   Sale Price           693 non-null    float64
 7   Gross Sales          695 non-null    float64
 8   Discounts            695 non-null    float64
 9    Sales               700 non-null    float64
 10  COGS                 700 non-null    float64
 11  Profit               700 non-null    float64
 12  Date                 700 non-null    datetime64[ns]
 13  Month Number         700 non-null    int64
 14  Month Name           700 non-null    object
 15  Year                 700 non-null    int64
dtypes: datetime64[ns](1), float64(7), int64(3), object(5)
memory usage: 87.6+ KB

In [61]:
df.isnull().sum()

Segment                 8
Country                11
Product                 8
Discount Band          62
Units Sold              5
Manufacturing Price     0
Sale Price              7
Gross Sales             5
Discounts               5
 Sales                  0
COGS                    0
Profit                  0
Date                    0
Month Number            0
Month Name              0
Year                    0
dtype: int64

In [62]:
df.isnull().sum().sum()

np.int64(111)

In [63]:
df.shape[0]

700

In [64]:
df.isnull().sum().sum()/df.shape[0]*100

np.float64(15.857142857142856)

In [65]:
df.columns

Index(['Segment', 'Country', 'Product', 'Discount Band', 'Units Sold',
       'Manufacturing Price', 'Sale Price', 'Gross Sales', 'Discounts',
       ' Sales', 'COGS', 'Profit', 'Date', 'Month Number', 'Month Name',
       'Year'],
      dtype='object')

In [76]:
dtype = []
for col in df.columns:
    if df[col].isnull().sum()>0:
        print(col,'\t',df[col].dtype)
        if df[col].dtype not in dtype:
            dtype.append(df[col].dtype)

Segment 	 object
Country 	 object
Product 	 object
Discount Band 	 object
Units Sold 	 float64
Sale Price 	 float64
Gross Sales 	 float64
Discounts 	 float64

In [77]:
print(dtype)

[dtype('O'), dtype('float64')]

In [86]:
for col in df.columns:
    if df[col].isnull().sum()>0:
        if df[col].dtype=='object':
            df[col] = df[col].fillna(value=df[col].mode()[0])
        else:
            df[col] = df[col].fillna(value=df[col].mean())

In [87]:
df.shape

(700, 16)

In [92]:
df.Segment.mode()[0]

'Government'

In [90]:
df.Profit.mean()

np.float64(24133.860371428567)

In [93]:
df.isnull().sum()

Segment                0
Country                0
Product                0
Discount Band          0
Units Sold             0
Manufacturing Price    0
Sale Price             0
Gross Sales            0
Discounts              0
 Sales                 0
COGS                   0
Profit                 0
Date                   0
Month Number           0
Month Name             0
Year                   0
dtype: int64